# Install Library

In [ ]:
! conda install pandas

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

==> WARNING: A newer version of conda exists. <==
  current version: 23.3.1
  latest version: 23.5.0

Please update conda by running

    $ conda update -n base -c defaults conda

Or to minimize the number of packages updated during conda update use

     conda install conda=23.5.0

In [ ]:
! pip3 install pymysql
! pip3 install ipython-sql
! pip3 install mysqlclient

Requirement already satisfied: pymysql in c:\users\m s i\anaconda3\lib\site-packages (1.0.3)
Requirement already satisfied: ipython-sql in c:\users\m s i\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (2.0.14)
Requirement already satisfied: ipython in c:\users\m s i\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\m s i\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\m s i\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: stack-data in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: matplotlib-inline in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: backcall in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: jedi>=0.16 in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: colorama in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: pickleshare in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pygments>=2.4.0 in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: decorator in c:\users\m s i\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in c:\users\m s i\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\m s i\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\m s i\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\m s i\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\m s i\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: mysqlclient in c:\users\m s i\anaconda3\lib\site-packages (2.1.1)

# Koneksikan ke MySQL

## Import Libraries

In [ ]:
import os
import pymysql
import pandas as pd
import mysql.connector

## Inisiasi Attributes

In [ ]:
db_name = "cobatubeskel1"
db_host = "localhost"
db_username = "root"
db_password = ""

## Membuat Koneksi ke Database

In [ ]:
try:
    conn = pymysql.connect(host = db_host,
                          port = int(3306),
                          user = 'root',
                          passwd = db_password,
                          db = db_name)
except e:
    print(e)

if conn:
    print("Successfully Connected")
else:
    print("Error")

Successfully Connected

## Mengaktifkan Database

In [ ]:
%%sql

USE cobatubeskel1;

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

## Aktivasi Magic Function

In [ ]:
%load_ext sql
%sql mysql+mysqldb://root@localhost

# Import Dataset

In [ ]:
dataset = pd.read_csv("C:/Users/M S I/Downloads/archive (4)/Train.csv")
dataset

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms,Reached_on_Time_Y_N
0,1,D,Flight,4,2,177,3,low,F,44,1233,1
1,2,F,Flight,4,5,216,2,low,M,59,3088,1
2,3,A,Flight,2,2,183,4,low,M,48,3374,1
3,4,B,Flight,3,3,176,4,medium,M,10,1177,1
4,5,C,Flight,2,2,184,3,medium,F,46,2484,1
...,...,...,...,...,...,...,...,...,...,...,...,...
10994,10995,A,Ship,4,1,252,5,medium,F,1,1538,1
10995,10996,B,Ship,4,1,232,5,medium,F,6,1247,0
10996,10997,C,Ship,5,4,242,5,low,F,4,1155,0
10997,10998,F,Ship,5,2,223,6,medium,M,2,1210,0
10998,10999,D,Ship,2,5,155,5,low,F,6,1639,0

# Lakukan Normalisasi 2NF

In [ ]:
Warehouse = dataset[['ID', 'Warehouse_block']]
Warehouse

          ID Warehouse_block
0          1               D
1          2               F
2          3               A
3          4               B
4          5               C
...      ...             ...
10994  10995               A
10995  10996               B
10996  10997               C
10997  10998               F
10998  10999               D

[10999 rows x 2 columns]

In [ ]:
Shipment_Mode = dataset[['ID', 'Mode_of_Shipment']]
Shipment_Mode

          ID Mode_of_Shipment
0          1           Flight
1          2           Flight
2          3           Flight
3          4           Flight
4          5           Flight
...      ...              ...
10994  10995             Ship
10995  10996             Ship
10996  10997             Ship
10997  10998             Ship
10998  10999             Ship

[10999 rows x 2 columns]

In [ ]:
Customer = dataset[['ID', 'Customer_care_calls', 'Customer_rating', 'Prior_purchases', 'Product_importance', 'Gender']]
Customer

,ID,Customer_care_calls,Customer_rating,Prior_purchases,Product_importance,Gender
0,1,4,2,3,low,F
1,2,4,5,2,low,M
2,3,2,2,4,low,M
3,4,3,3,4,medium,M
4,5,2,2,3,medium,F
...,...,...,...,...,...,...
10994,10995,4,1,5,medium,F
10995,10996,4,1,5,medium,F
10996,10997,5,4,5,low,F
10997,10998,5,2,6,medium,M
10998,10999,2,5,5,low,F

In [ ]:
Product = dataset[['ID', 'Cost_of_the_Product', 'Discount_offered', 'Weight_in_gms', 'Reached_on_Time_Y_N']]
Product

,ID,Cost_of_the_Product,Discount_offered,Weight_in_gms,Reached_on_Time_Y_N
0,1,177,44,1233,1
1,2,216,59,3088,1
2,3,183,48,3374,1
3,4,176,10,1177,1
4,5,184,46,2484,1
...,...,...,...,...,...
10994,10995,252,1,1538,1
10995,10996,232,6,1247,0
10996,10997,242,4,1155,0
10997,10998,223,2,1210,0
10998,10999,155,6,1639,0

# Implementasi Syntax DDL dan DML

## A. Data Definition Language (DDL)

### DDL untuk Database

#### Membuat Database

In [ ]:
%%sql

CREATE DATABASE databasetubes;

 * mysql+mysqldb://root@localhost
(MySQLdb.ProgrammingError) (1007, "Can't create database 'databasetubes'; database exists")
[SQL: CREATE DATABASE databasetubes;]
(Background on this error at: https://sqlalche.me/e/20/f405)

#### Mengaktifkan Database

In [ ]:
%%sql

USE databasetubes;

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

### DDL untuk Table

#### Tabel Warehouse

##### Membuat Tabel

In [ ]:
%%sql

CREATE TABLE Warehouse(
ID INT,
Warehouse_block VARCHAR(1)
);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

##### Menambahkan Primary Key

In [ ]:
%%sql

ALTER TABLE Warehouse
ADD PRIMARY KEY(ID);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

##### Menampilkan Struktur Tabel

In [ ]:
%%sql

DESC Warehouse;

 * mysql+mysqldb://root@localhost
2 rows affected.

[('ID', 'int(11)', 'NO', 'PRI', None, ''),
 ('Warehouse_block', 'varchar(1)', 'YES', '', None, '')]

##### Memasukkan Record ke Tabel

In [ ]:
%%sql

INSERT INTO Warehouse(ID, Warehouse_block)
VALUES
    (1, 'D'),
    (2, 'F'),
    (3, 'A'),
    (4, 'B'),
    (5, 'C'),
    (6, 'F'),
    (7, 'D'),
    (8, 'F'),
    (9, 'A'),
    (10, 'B'),
    (11, 'C'),
    (12, 'F'),
    (13, 'D'),
    (14, 'F'),
    (15, 'A'),
    (16, 'B'),
    (17, 'C'),
    (18, 'F'),
    (19, 'D'),
    (20, 'F'),
    (21, 'A'),
    (22, 'B'),
    (23, 'C'),
    (24, 'F'),
    (25, 'D'),
    (26, 'F'),
    (27, 'A'),
    (28, 'B'),
    (29, 'C'),
    (30, 'F');

 * mysql+mysqldb://root@localhost
30 rows affected.

[]

##### Menampilkan Record pada Tabel

In [ ]:
%%sql

SELECT * FROM Warehouse;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(1, 'D'),
 (2, 'F'),
 (3, 'A'),
 (4, 'B'),
 (5, 'C'),
 (6, 'F'),
 (7, 'D'),
 (8, 'F'),
 (9, 'A'),
 (10, 'B'),
 (11, 'C'),
 (12, 'F'),
 (13, 'D'),
 (14, 'F'),
 (15, 'A'),
 (16, 'B'),
 (17, 'C'),
 (18, 'F'),
 (19, 'D'),
 (20, 'F'),
 (21, 'A'),
 (22, 'B'),
 (23, 'C'),
 (24, 'F'),
 (25, 'D'),
 (26, 'F'),
 (27, 'A'),
 (28, 'B'),
 (29, 'C'),
 (30, 'F')]

#### Tabel Shipment Mode

##### Membuat Tabel

In [ ]:
%%sql

CREATE TABLE Shipment_Mode(
ID INT,
Mode_of_Shipment VARCHAR(10),
FOREIGN KEY (ID) REFERENCES Warehouse(ID)
);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

##### Menampilkan Struktur Tabel

In [ ]:
%%sql

DESC Shipment_Mode;

 * mysql+mysqldb://root@localhost
2 rows affected.

[('ID', 'int(11)', 'YES', 'MUL', None, ''),
 ('Mode_of_Shipment', 'varchar(10)', 'YES', '', None, '')]

##### Memasukkan Record ke Tabel

In [ ]:
%%sql

INSERT INTO Shipment_Mode(ID, Mode_of_Shipment)
VALUES
(1, 'Flight'),
(2, 'Flight'),
(3, 'Flight'),
(4, 'Flight'),
(5, 'Flight'),
(6, 'Flight'),
(7, 'Flight'),
(8, 'Flight'),
(9, 'Flight'),
(10, 'Flight'),
(11, 'Flight'),
(12, 'Flight'),
(13, 'Flight'),
(14, 'Flight'),
(15, 'Flight'),
(16, 'Flight'),
(17, 'Flight'),
(18, 'Ship'),
(19, 'Ship'),
(20, 'Ship'),
(21, 'Ship'),
(22, 'Ship'),
(23, 'Ship'),
(24, 'Ship'),
(25, 'Ship'),
(26, 'Ship'),
(27, 'Ship'),
(28, 'Ship'),
(29, 'Ship'),
(30, 'Ship');

 * mysql+mysqldb://root@localhost
30 rows affected.

[]

##### Menampilkan Record pada Tabel

In [ ]:
%%sql

SELECT * FROM Shipment_Mode;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(1, 'Flight'),
 (2, 'Flight'),
 (3, 'Flight'),
 (4, 'Flight'),
 (5, 'Flight'),
 (6, 'Flight'),
 (7, 'Flight'),
 (8, 'Flight'),
 (9, 'Flight'),
 (10, 'Flight'),
 (11, 'Flight'),
 (12, 'Flight'),
 (13, 'Flight'),
 (14, 'Flight'),
 (15, 'Flight'),
 (16, 'Flight'),
 (17, 'Flight'),
 (18, 'Ship'),
 (19, 'Ship'),
 (20, 'Ship'),
 (21, 'Ship'),
 (22, 'Ship'),
 (23, 'Ship'),
 (24, 'Ship'),
 (25, 'Ship'),
 (26, 'Ship'),
 (27, 'Ship'),
 (28, 'Ship'),
 (29, 'Ship'),
 (30, 'Ship')]

#### Tabel Customer

##### Membuat Tabel

In [ ]:
%%sql

CREATE TABLE Customer(
ID INT,
Customer_care_calls INT,
Customer_rating INT,
Prior_purchases INT,
Product_importance VARCHAR(10),
Gender ENUM('F', 'M'),
FOREIGN KEY (ID) REFERENCES Warehouse (ID)
);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

##### Menampilkan Struktur Tabel

In [ ]:
%%sql

DESC Customer;

 * mysql+mysqldb://root@localhost
6 rows affected.

[('ID', 'int(11)', 'YES', 'MUL', None, ''),
 ('Customer_care_calls', 'int(11)', 'YES', '', None, ''),
 ('Customer_rating', 'int(11)', 'YES', '', None, ''),
 ('Prior_purchases', 'int(11)', 'YES', '', None, ''),
 ('Product_importance', 'varchar(10)', 'YES', '', None, ''),
 ('Gender', "enum('F','M')", 'YES', '', None, '')]

##### Memasukkan Record ke Tabel

In [ ]:
%%sql

INSERT INTO Customer(ID, Customer_care_calls, Customer_rating, Prior_purchases, Product_importance, Gender)
VALUES
(1, 4, 2, 3, 'low', 'F'),
(2, 4, 5, 2, 'low', 'M'),
(3, 2, 2, 4, 'low', 'M'),
(4, 3, 3, 4, 'medium', 'M'),
(5, 2, 2, 3, 'medium', 'F'),
(6, 3, 1, 3, 'medium', 'F'),
(7, 3, 4, 3, 'low', 'F'),
(8, 4, 1, 2, 'low', 'F'),
(9, 3, 4, 3, 'low', 'F'),
(10, 3, 2, 3, 'medium', 'F'),
(11, 3, 4, 2, 'medium', 'M'),
(12, 4, 5, 3, 'medium', 'F'),
(13, 3, 5, 3, 'medium', 'F'),
(14, 4, 4, 3, 'high', 'M'),
(15, 4, 3, 3, 'low', 'M'),
(16, 4, 3, 3, 'low', 'F'),
(17, 3, 4, 2, 'medium', 'F'),
(18, 5, 5, 3, 'medium', 'M'),
(19, 5, 5, 3, 'high', 'M'),
(20, 4, 5, 3, 'medium', 'M'),
(21, 3, 3, 2, 'medium', 'F'),
(22, 3, 1, 4, 'medium', 'F'),
(23, 2, 5, 2, 'low', 'M'),
(24, 4, 3, 3, 'high', 'M'),
(25, 4, 5, 2, 'medium', 'F'),
(26, 3, 1, 4, 'low', 'M'),
(27, 4, 1, 3, 'high', 'F'),
(28, 5, 1, 3, 'medium', 'M'),
(29, 2, 3, 4, 'low', 'M'),
(30, 5, 4, 2, 'low', 'F');

 * mysql+mysqldb://root@localhost
30 rows affected.

[]

##### Menampilkan Record pada Tabel

In [ ]:
%%sql

SELECT * FROM Customer;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(1, 4, 2, 3, 'low', 'F'),
 (2, 4, 5, 2, 'low', 'M'),
 (3, 2, 2, 4, 'low', 'M'),
 (4, 3, 3, 4, 'medium', 'M'),
 (5, 2, 2, 3, 'medium', 'F'),
 (6, 3, 1, 3, 'medium', 'F'),
 (7, 3, 4, 3, 'low', 'F'),
 (8, 4, 1, 2, 'low', 'F'),
 (9, 3, 4, 3, 'low', 'F'),
 (10, 3, 2, 3, 'medium', 'F'),
 (11, 3, 4, 2, 'medium', 'M'),
 (12, 4, 5, 3, 'medium', 'F'),
 (13, 3, 5, 3, 'medium', 'F'),
 (14, 4, 4, 3, 'high', 'M'),
 (15, 4, 3, 3, 'low', 'M'),
 (16, 4, 3, 3, 'low', 'F'),
 (17, 3, 4, 2, 'medium', 'F'),
 (18, 5, 5, 3, 'medium', 'M'),
 (19, 5, 5, 3, 'high', 'M'),
 (20, 4, 5, 3, 'medium', 'M'),
 (21, 3, 3, 2, 'medium', 'F'),
 (22, 3, 1, 4, 'medium', 'F'),
 (23, 2, 5, 2, 'low', 'M'),
 (24, 4, 3, 3, 'high', 'M'),
 (25, 4, 5, 2, 'medium', 'F'),
 (26, 3, 1, 4, 'low', 'M'),
 (27, 4, 1, 3, 'high', 'F'),
 (28, 5, 1, 3, 'medium', 'M'),
 (29, 2, 3, 4, 'low', 'M'),
 (30, 5, 4, 2, 'low', 'F')]

#### Tabel Product

##### Membuat Tabel

In [ ]:
%%sql

CREATE TABLE Product(
ID INT,
Cost_of_the_Product INT,
Discount_offered INT,
Weight_in_gms INT,
Reached_on_Time_Y_N INT,
FOREIGN KEY (ID) REFERENCES Warehouse (ID)
);

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

##### Menampilkan Struktur Tabel

In [ ]:
%%sql

DESC Product;

 * mysql+mysqldb://root@localhost
5 rows affected.

[('ID', 'int(11)', 'YES', 'MUL', None, ''),
 ('Cost_of_the_Product', 'int(11)', 'YES', '', None, ''),
 ('Discount_offered', 'int(11)', 'YES', '', None, ''),
 ('Weight_in_gms', 'int(11)', 'YES', '', None, ''),
 ('Reached_on_Time_Y_N', 'int(11)', 'YES', '', None, '')]

##### Memasukkan Record ke Tabel

In [ ]:
%%sql

INSERT INTO Product(ID, Cost_of_the_Product, Discount_offered, Weight_in_gms, Reached_on_Time_Y_N)
VALUES
(1, 177, 44, 1233, 1),
(2, 216, 59, 3088, 1),
(3, 183, 48, 3374, 1),
(4, 176, 10, 1177, 1),
(5, 184, 46, 2484, 1),
(6, 162, 12, 1417, 1),
(7, 250, 3, 2371, 1),
(8, 233, 48, 2804, 1),
(9, 150, 11, 1861, 1),
(10, 164, 29, 1187, 1),
(11, 189, 12, 2888, 1),
(12, 232, 32, 3253, 1),
(13, 198, 1, 3667, 1),
(14, 275, 29, 2602, 1),
(15, 152, 43, 1009, 1),
(16, 227, 45, 2707, 1),
(17, 143, 6, 1194, 1),
(18, 227, 36, 3952, 1),
(19, 239, 18, 2495, 1),
(20, 145, 45, 1059, 1),
(21, 161, 38, 1521, 1),
(22, 232, 51, 2899, 1),
(23, 156, 2, 1750, 1),
(24, 211, 12, 3922, 1),
(25, 251, 28, 3561, 1),
(26, 225, 29, 3496, 1),
(27, 172, 24, 1066, 1),
(28, 162, 31, 1435, 1),
(29, 234, 44, 3134, 1),
(30, 183, 36, 3819, 1);

 * mysql+mysqldb://root@localhost
30 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM Product;

 * mysql+mysqldb://root@localhost
30 rows affected.

[(1, 177, 44, 1233, 1),
 (2, 216, 59, 3088, 1),
 (3, 183, 48, 3374, 1),
 (4, 176, 10, 1177, 1),
 (5, 184, 46, 2484, 1),
 (6, 162, 12, 1417, 1),
 (7, 250, 3, 2371, 1),
 (8, 233, 48, 2804, 1),
 (9, 150, 11, 1861, 1),
 (10, 164, 29, 1187, 1),
 (11, 189, 12, 2888, 1),
 (12, 232, 32, 3253, 1),
 (13, 198, 1, 3667, 1),
 (14, 275, 29, 2602, 1),
 (15, 152, 43, 1009, 1),
 (16, 227, 45, 2707, 1),
 (17, 143, 6, 1194, 1),
 (18, 227, 36, 3952, 1),
 (19, 239, 18, 2495, 1),
 (20, 145, 45, 1059, 1),
 (21, 161, 38, 1521, 1),
 (22, 232, 51, 2899, 1),
 (23, 156, 2, 1750, 1),
 (24, 211, 12, 3922, 1),
 (25, 251, 28, 3561, 1),
 (26, 225, 29, 3496, 1),
 (27, 172, 24, 1066, 1),
 (28, 162, 31, 1435, 1),
 (29, 234, 44, 3134, 1),
 (30, 183, 36, 3819, 1)]

#### Melihat Daftar Keseluruhan Tabel yang Telah Dibuat

In [ ]:
%%sql

SHOW TABLES;

 * mysql+mysqldb://root@localhost
4 rows affected.

[('customer',), ('product',), ('shipment_mode',), ('warehouse',)]

## B. Data Manipulation Language (DML)

### Melakukan Update pada Tabel

In [ ]:
%%sql

UPDATE Product
SET Discount_offered = 25
WHERE ID = 1;

 * mysql+mysqldb://root@localhost
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM product LIMIT 5;

 * mysql+mysqldb://root@localhost
5 rows affected.

[(1, 177, 25, 1233, 1),
 (2, 216, 59, 3088, 1),
 (3, 183, 48, 3374, 1),
 (4, 176, 10, 1177, 1),
 (5, 184, 46, 2484, 1)]

In [ ]:
%%sql

UPDATE Customer
SET Customer_rating = 5, Prior_purchases = 2 ,Gender = 'M'
WHERE ID = 3;

 * mysql+mysqldb://root@localhost
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM Customer LIMIT 5;

 * mysql+mysqldb://root@localhost
5 rows affected.

[(1, 4, 2, 3, 'low', 'F'),
 (2, 4, 5, 2, 'low', 'M'),
 (3, 2, 5, 2, 'low', 'M'),
 (4, 3, 3, 4, 'medium', 'M'),
 (5, 2, 2, 3, 'medium', 'F')]

In [ ]:
%%sql

UPDATE Shipment_Mode
SET Mode_of_Shipment = 'Ship'
WHERE ID = 3;

 * mysql+mysqldb://root@localhost
1 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM Shipment_Mode LIMIT 5;

 * mysql+mysqldb://root@localhost
5 rows affected.

[(1, 'Flight'), (2, 'Flight'), (3, 'Ship'), (4, 'Flight'), (5, 'Flight')]

### Melakukan Select pada Tabel untuk Melihat Baris yang Sedang Diperlukan

In [ ]:
%%sql

SELECT ID, Customer_rating, Gender
FROM Customer
LIMIT 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[(1, 2, 'F'),
 (2, 5, 'M'),
 (3, 5, 'M'),
 (4, 3, 'M'),
 (5, 2, 'F'),
 (6, 1, 'F'),
 (7, 4, 'F'),
 (8, 1, 'F'),
 (9, 4, 'F'),
 (10, 2, 'F')]

In [ ]:
%%sql

SELECT ID, Cost_of_the_Product, Weight_in_gms
FROM Product
LIMIT 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[(1, 177, 1233),
 (2, 216, 3088),
 (3, 183, 3374),
 (4, 176, 1177),
 (5, 184, 2484),
 (6, 162, 1417),
 (7, 250, 2371),
 (8, 233, 2804),
 (9, 150, 1861),
 (10, 164, 1187)]

In [ ]:
%%sql

SELECT ID, Customer_rating, Product_importance
FROM Customer
LIMIT 10;

 * mysql+mysqldb://root@localhost
10 rows affected.

[(1, 2, 'low'),
 (2, 5, 'low'),
 (3, 5, 'low'),
 (4, 3, 'medium'),
 (5, 2, 'medium'),
 (6, 1, 'medium'),
 (7, 4, 'low'),
 (8, 1, 'low'),
 (9, 4, 'low'),
 (10, 2, 'medium')]

# Relational Schema
Mengecek Constraint pada tiap tabel

In [ ]:
%%sql

SHOW CREATE TABLE Warehouse;

 * mysql+mysqldb://root@localhost
1 rows affected.

[('Warehouse', 'CREATE TABLE `warehouse` (\n  `ID` int(11) NOT NULL,\n  `Warehouse_block` varchar(1) DEFAULT NULL,\n  PRIMARY KEY (`ID`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci')]

In [ ]:
%%sql

SHOW CREATE TABLE Shipment_Mode;

 * mysql+mysqldb://root@localhost
1 rows affected.

[('Shipment_Mode', 'CREATE TABLE `shipment_mode` (\n  `ID` int(11) DEFAULT NULL,\n  `Mode_of_Shipment` varchar(10) DEFAULT NULL,\n  KEY `ID` (`ID`),\n  CONSTRAINT `shipment_mode_ibfk_1` FOREIGN KEY (`ID`) REFERENCES `warehouse` (`ID`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci')]

In [ ]:
%%sql

SHOW CREATE TABLE Customer;

 * mysql+mysqldb://root@localhost
1 rows affected.

[('Customer', "CREATE TABLE `customer` (\n  `ID` int(11) DEFAULT NULL,\n  `Customer_care_calls` int(11) DEFAULT NULL,\n  `Customer_rating` int(11) DEFAULT NULL,\n   ... (149 characters truncated) ... \n  CONSTRAINT `customer_ibfk_1` FOREIGN KEY (`ID`) REFERENCES `warehouse` (`ID`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci")]

In [ ]:
%%sql

SHOW CREATE TABLE Product;

 * mysql+mysqldb://root@localhost
1 rows affected.

[('Product', 'CREATE TABLE `product` (\n  `ID` int(11) DEFAULT NULL,\n  `Cost_of_the_Product` int(11) DEFAULT NULL,\n  `Discount_offered` int(11) DEFAULT NULL,\n   ... (103 characters truncated) ... ,\n  CONSTRAINT `product_ibfk_1` FOREIGN KEY (`ID`) REFERENCES `warehouse` (`ID`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci')]

# Melakukan Advance Query pada Dataset
Dari 30 data teratas

## 1. Menampilkan rata-rata Customer Rating berdasarkan Gender

In [ ]:
%%sql

SELECT Gender, AVG(Customer_rating) AS Average_Rating
FROM Customer
GROUP BY Gender;

 * mysql+mysqldb://root@localhost
2 rows affected.

[('F', Decimal('2.9375')), ('M', Decimal('3.7143'))]

## 2. Menampilkan jumlah Customer Care Calls yang dilakukan oleh setiap Mode of Shipment

In [ ]:
%%sql

SELECT Mode_of_Shipment, SUM(Customer_care_calls) AS Total_Calls
FROM Shipment_Mode, Customer
GROUP BY Mode_of_Shipment;

 * mysql+mysqldb://root@localhost
2 rows affected.

[('Flight', Decimal('1680')), ('Ship', Decimal('1470'))]

## 3. Menampilkan persentase produk yang sampai tepat waktu

In [ ]:
%%sql

SELECT COUNT(*) AS Total,
       SUM(CASE WHEN Reached_on_Time_Y_N = 'Y' THEN 1 ELSE 0 END) AS Reached_on_Time,
       (SUM(CASE WHEN Reached_on_Time_Y_N = 'Y' THEN 1 ELSE 0 END) / COUNT(*)) * 100 AS Percentage
FROM Product;

 * mysql+mysqldb://root@localhost
1 rows affected.

[(30, Decimal('0'), Decimal('0.0000'))]

## 4. Menampilkan rata-rata Cost of the Product berdasarkan Product Importance

In [ ]:
%%sql

SELECT Product_importance, AVG(Cost_of_the_Product) AS Average_Cost
FROM Customer, Product
GROUP BY Product_importance;

 * mysql+mysqldb://root@localhost
3 rows affected.

[('high', Decimal('196.9667')),
 ('low', Decimal('196.9667')),
 ('medium', Decimal('196.9667'))]

## 5. Menampilkan jumlah Prior Purchases yang dilakukan oleh setiap Customer Rating

In [ ]:
%%sql

SELECT Customer_rating, SUM(Prior_purchases) AS Total_Purchases
FROM Customer
GROUP BY Customer_rating;

 * mysql+mysqldb://root@localhost
5 rows affected.

[(1, Decimal('19')),
 (2, Decimal('9')),
 (3, Decimal('19')),
 (4, Decimal('15')),
 (5, Decimal('23'))]

## 6. Menampilkan berat rata-rata produk berdasarkan Mode of Shipment

In [ ]:
%%sql

SELECT Mode_of_Shipment, AVG(Weight_in_gms) AS Average_Weight
FROM Shipment_Mode, Product
GROUP BY Mode_of_Shipment;

 * mysql+mysqldb://root@localhost
2 rows affected.

[('Flight', Decimal('2414.1667')), ('Ship', Decimal('2414.1667'))]

## 7. Menampilkan jumlah produk dengan Discount Offered tertinggi

In [ ]:
%%sql

SELECT Discount_offered, COUNT(*) AS Total
FROM Product
GROUP BY Discount_offered
ORDER BY Discount_offered DESC
LIMIT 1;

 * mysql+mysqldb://root@localhost
1 rows affected.

[(59, 1)]

## 8. Menampilkan produk dengan Cost of the Product tertinggi dan terendah

In [ ]:
%%sql

SELECT * FROM Product
WHERE Cost_of_the_Product = (SELECT MAX(Cost_of_the_Product) FROM Product)
   OR Cost_of_the_Product = (SELECT MIN(Cost_of_the_Product) FROM Product);

 * mysql+mysqldb://root@localhost
2 rows affected.

[(14, 275, 29, 2602, 1), (17, 143, 6, 1194, 1)]

## 9. Menampilkan mode pengiriman dengan jumlah produk terbanyak

In [ ]:
%%sql

SELECT Mode_of_Shipment, COUNT(*) AS Total
FROM Shipment_Mode
GROUP BY Mode_of_Shipment
ORDER BY Total DESC
LIMIT 1;

 * mysql+mysqldb://root@localhost
1 rows affected.

[('Flight', 16)]

## 10. Menampilkan jumlah produk berdasarkan Warehouse Block dan Gender

In [ ]:
%%sql

SELECT Warehouse_block, Gender, COUNT(*) AS Total
FROM Warehouse, Customer
GROUP BY Warehouse_block, Gender;

 * mysql+mysqldb://root@localhost
10 rows affected.

[('A', 'F', 80),
 ('A', 'M', 70),
 ('B', 'F', 80),
 ('B', 'M', 70),
 ('C', 'F', 80),
 ('C', 'M', 70),
 ('D', 'F', 80),
 ('D', 'M', 70),
 ('F', 'F', 160),
 ('F', 'M', 140)]

## 11. Menampilkan jumlah Customer berdasarkan Warehouse Block

In [ ]:
%%sql

SELECT w.Warehouse_block, COUNT(c.ID) AS Total_Customers
FROM Warehouse w
LEFT JOIN Customer c ON w.ID = c.ID
GROUP BY w.Warehouse_block;

 * mysql+mysqldb://root@localhost
5 rows affected.

[('A', 5), ('B', 5), ('C', 5), ('D', 5), ('F', 10)]

# User Management

## Membuat User

### user_1

In [ ]:
%%sql

CREATE USER 'user_1'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

### user_2

In [ ]:
%%sql

CREATE USER 'user_2'@'localhost'

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

## Menambahkan Hak Akses ke User

### user_root
Dapat melakukan semua proses query

In [ ]:
%%sql

GRANT ALL PRIVILEGES ON databasetubes.* TO 'user_root'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

### user_1
Tidak dapat melakukan UPDATE

In [ ]:
%%sql

GRANT SELECT ON databasetubes.* TO 'user_1'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

### user_2
Tidak dapat melakukan CREATE

In [ ]:
%%sql

GRANT INSERT, UPDATE, DELETE ON databasetubes.* TO 'user_2'@'localhost';

 * mysql+mysqldb://root@localhost
0 rows affected.

[]

## Menampilkan Hak Akses

### user_root

In [ ]:
%%sql

SHOW GRANTS FOR 'user_root'@'localhost';

 * mysql+mysqldb://root@localhost
2 rows affected.

[("GRANT ALL PRIVILEGES ON *.* TO `user_root`@`localhost` IDENTIFIED BY PASSWORD '*2470C0C06DEE42FD1618BB99005ADCA2EC9D1E19' WITH GRANT OPTION",),
 ('GRANT ALL PRIVILEGES ON `databasetubes`.* TO `user_root`@`localhost`',)]

### user_1

In [ ]:
%%sql

SHOW GRANTS FOR 'user_1'@'localhost';

 * mysql+mysqldb://root@localhost
1 rows affected.

[('GRANT USAGE ON *.* TO `user_1`@`localhost`',)]

### user_2

In [ ]:
%%sql

SHOW GRANTS FOR 'user_2'@'localhost';

 * mysql+mysqldb://root@localhost
2 rows affected.

[('GRANT USAGE ON *.* TO `user_2`@`localhost`',),
 ('GRANT INSERT, UPDATE, DELETE ON `databasetubes`.* TO `user_2`@`localhost`',)]